Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Sdmmc/Emmc/IfxSdmmc_Emmc.c
/**
 * \file IfxSdmmc_Emmc.c
 * \brief SDMMC EMMC details
 *
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/
#include "Ifx_Cfg.h"
#if defined (__TASKING__)
#pragma warning 508		/* To suppress empty file warning */
#endif
#if defined (__ghs__)
#pragma diag_suppress 96		/* To suppress empty file warning */
#endif
#if defined(DEVICE_TC33XED) || defined(DEVICE_TC37XED) ||  defined(DEVICE_TC38EVOX) || defined(DEVICE_TC39XB)
#include "IfxSdmmc_Emmc.h"

/******************************************************************************/
/*-------------------------Function Implementations---------------------------*/
/******************************************************************************/

IfxSdmmc_Status IfxSdmmc_Emmc_initCard(IfxSdmmc_Emmc *emmc, IfxSdmmc_Emmc_CardConfig *cardConfig)
{
    IfxSdmmc_Status   status = IfxSdmmc_Status_success;
    IfxSdmmc_Response response;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR;

    /* set up the SD card interface, power up the card */
    /* power on bus */
    emmcPtr->PWR_CTRL.B.SD_BUS_PWR_VDD1 = 1;

    /* Enable the SD clock */
    emmcPtr->CLK_CTRL.B.SD_CLK_EN = 1;

    /* according to SD Card spec we've to wait for 74 cycles with CMD and DAT high */
    {
        uint32 loopCount = (IFXSDMMC_DELAY_74CYCLE_US * IFXSDMMC_1KMULTIPLIER) / IFXSDMMC_1KLOOPDELAY_US;
        uint32 index;

        for (index = 0; index < loopCount; ++index)
        {
            //do nothing
            __nop();
        }
    }

    status = IfxSdmmc_Emmc_identifyCard(emmc, cardConfig);

    if (status == IfxSdmmc_Status_success)
    {
        status = IfxSdmmc_Emmc_configureSpeedAndBusWidth(emmc, cardConfig);
    }

    if (status == IfxSdmmc_Status_success)
    {
        /* Explicitly set block size as 512 */
        status = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_setBlockLength, IFXSDMMC_BLOCKSIZE_512, IfxSdmmc_ResponseType_r1, &response);
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_identifyCard(IfxSdmmc_Emmc *emmc, IfxSdmmc_Emmc_CardConfig *cardConfig)
{
    IfxSdmmc_Status status = IfxSdmmc_Status_cardNotInitialised;

    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* Initialize and identify the eMMC card */

    /* Reset the card (CMD0) */
    status = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_goIdleState, IFXSDMMC_ARG_NONE, IfxSdmmc_ResponseType_none, NULL_PTR);

    if (status == IfxSdmmc_Status_success)
    {
        /* validate Access Mode (MMC_CMD1) */
        status = IfxSdmmc_Emmc_validateAccessMode(emmc);
    }

    if (status == IfxSdmmc_Status_success)
    {
        /* Read CID, CMD2 */
        status = IfxSdmmc_Emmc_readCid(emmc);

        if (status == IfxSdmmc_Status_success)
        {
            /* Set RCA, CMD3 */
            status = IfxSdmmc_Emmc_setRca(emmc, IFXSDMMC_RCACMD3);

            if (status == IfxSdmmc_Status_success)
            {
                /* Read CSD, CMD9 */
                status = IfxSdmmc_Emmc_readCsd(emmc);
            }
        }
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_configureSpeedAndBusWidth(IfxSdmmc_Emmc *emmc, IfxSdmmc_Emmc_CardConfig *cardConfig)
{
    IfxSdmmc_Status status = IfxSdmmc_Status_success;

    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* Switch speed and bus width */
    /* Switch to transfer state (CMD7) */
    status = IfxSdmmc_Emmc_switchToTransferState(emmc);

    if (status == IfxSdmmc_Status_success)
    {
        /* switch Bus Width if selected */
        if (cardConfig->dataWidth > IfxSdmmc_EmmcDataTransferWidth_1Bit)
        {
            status = IfxSdmmc_Emmc_switchBusWidth(emmc, cardConfig->dataWidth);
        }

        /* Switch Speed if selected */
        if (cardConfig->speedMode == IfxSdmmc_EmmcSpeedMode_highSpeedSdr)
        {
            status = IfxSdmmc_Emmc_switchToHighSpeed(emmc);

            if (status == IfxSdmmc_Status_success)
            {
                /* Configure clock parameters to 50MHz*/
                IfxSdmmc_configureClock(emmcPtr, IFXSDMMC_FREQUENCY_50MHZ);
            }
        }
        else
        {
            /* Configure clock parameters to 26 MHz*/
            IfxSdmmc_configureClock(emmcPtr, emmc->userFrequency);
        }
    }

