Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Sdmmc/Emmc/IfxSdmmc_Emmc.c
    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_initHostController(IfxSdmmc_Emmc *emmc, IfxSdmmc_Emmc_HostConfig *hostConfig)
{
    IfxSdmmc_Status status = IfxSdmmc_Status_success;

    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* set the bus voltage */
    emmcPtr->PWR_CTRL.B.SD_BUS_VOL_VDD1 = IFXSDMMC_BUS_VOLTAGE_SELECT_VDD;

    /* set the data line timeout value */
    emmcPtr->TOUT_CTRL.B.TOUT_CNT = hostConfig->timeoutValue;

    /* set card type as eMMC */
    emmcPtr->EMMC_CTRL.B.CARD_IS_EMMC = 1;

    /* Configure clock parameters */
    /* set up clock for 400KHz now; we will change later */
    IfxSdmmc_configureClock(emmcPtr, IFXSDMMC_INIT_FREQUENCY);
    emmc->userFrequency = hostConfig->frequency;

    /* enable internal clock */
    status = IfxSdmmc_setUpInternalClock(emmcPtr);

    /* enable Host version 4 */
    IfxSdmmc_enableHostControllerVersion4(emmcPtr);
    emmcPtr->HOST_CTRL2.B.HOST_VER4_ENABLE = 1;

    /* Update ADMA2 length mode to 26 bits (supported) */
    emmcPtr->HOST_CTRL2.B.ADMA2_LEN_MODE = IfxSdmmc_Adma2LengthMode_26Bit;

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_initModule(IfxSdmmc_Emmc *emmc, IfxSdmmc_Emmc_Config *config)
{
    IfxSdmmc_Status status   = IfxSdmmc_Status_success;

    Ifx_SDMMC      *sdmmcSFR = config->sdmmcSFR;
    emmc->sdmmcSFR = sdmmcSFR;
    emmc->dmaUsed  = config->useDma;
    emmc->dmaType  = config->dmaConfig.dmaType;

    /* enable module */
    IfxSdmmc_enableModule(config->sdmmcSFR);

    config->sdmmcSFR->SW_RST.U |= 1;

    /* initialize the host controller for the card type */
    IfxSdmmc_Emmc_initHostController(emmc, &config->hostConfig);

    /* set DMA type if DMA is used for transfers */
    if (config->useDma)
    {
        emmc->sdmmcSFR->HOST_CTRL1.B.DMA_SEL = config->dmaConfig.dmaType;
    }

    IfxSdmmc_Emmc_configureInterrupt(emmc, &config->interruptConfig);

    /* setup pins */
    if (config->pins != NULL_PTR)
    {
        IfxSdmmc_Emmc_setupPins(emmc, config->pins);
    }

    /* set up, initialize and identify the card  */
    status = IfxSdmmc_Emmc_initCard(emmc, &config->cardConfig);

    return status;
}


void IfxSdmmc_Emmc_configureInterrupt(IfxSdmmc_Emmc *emmc, IfxSdmmc_InterruptConfig *interruptConfig)
{
    Ifx_SDMMC *sdmmcSFR = emmc->sdmmcSFR;

    /* enable the necessary normal interrupt status flags*/
    IfxSdmmc_enableNormalInterruptStatus(sdmmcSFR, IfxSdmmc_NormalInterrupt_commandComplete);
    IfxSdmmc_enableNormalInterruptStatus(sdmmcSFR, IfxSdmmc_NormalInterrupt_transferComplete);
    IfxSdmmc_enableNormalInterruptStatus(sdmmcSFR, IfxSdmmc_NormalInterrupt_dma);
    IfxSdmmc_enableNormalInterruptStatus(sdmmcSFR, IfxSdmmc_NormalInterrupt_bufferWriteReady);
    IfxSdmmc_enableNormalInterruptStatus(sdmmcSFR, IfxSdmmc_NormalInterrupt_bufferReadReady);
    /* enable all the error interrupt status flags */
    IfxSdmmc_enableAllErrorInterruptStatus(sdmmcSFR);

    /* initialize the normal interrupts */
    if (interruptConfig->priority > 0)
    {
        if (interruptConfig->commandCompleteInterruptEnable)
        {
            IfxSdmmc_enableNormalInterrupt(sdmmcSFR, IfxSdmmc_NormalInterrupt_commandComplete);
        }

        if (interruptConfig->transferCompleteInterruptEnable)
        {
            IfxSdmmc_enableNormalInterrupt(sdmmcSFR, IfxSdmmc_NormalInterrupt_transferComplete);
        }

        if (interruptConfig->dmaInterruptEnable)
        {
            IfxSdmmc_enableNormalInterrupt(sdmmcSFR, IfxSdmmc_NormalInterrupt_dma);
        }

        if (interruptConfig->commandTimeoutInterruptEnable)
        {
            IfxSdmmc_enableErrorInterrupt(sdmmcSFR, IfxSdmmc_ErrorInterrupt_commandTimeout);
        }

        if (interruptConfig->dataTimeoutInterruptEnable)
        {
            IfxSdmmc_enableErrorInterrupt(sdmmcSFR, IfxSdmmc_ErrorInterrupt_dataTimeout);
        }

        /* initialize service request node */
        volatile Ifx_SRC_SRCR *srcSFR;
        srcSFR = IfxSdmmc_getSrcPointer(sdmmcSFR, IfxSdmmc_InterruptType_normal);
        IfxSrc_init(srcSFR, interruptConfig->provider, interruptConfig->priority);
        IfxSrc_enable(srcSFR);
    }
}


void IfxSdmmc_Emmc_initModuleConfig(IfxSdmmc_Emmc_Config *config, Ifx_SDMMC *sdmmcSFR)
{
    const IfxSdmmc_Emmc_Config defaultConfig = {
        .sdmmcSFR   = NULL_PTR,
        .hostConfig = {
            .timeoutValue    = IfxSdmmc_DataLineTimeout_2Power27,
            .usePresetValues = TRUE,
            .frequency       = IFXSDMMC_FREQUENCY_26MHZ
        },
        .interruptConfig                     = {
            .commandCompleteInterruptEnable  = FALSE,
            .transferCompleteInterruptEnable = FALSE,
            .dmaInterruptEnable              = FALSE,
            .commandTimeoutInterruptEnable   = FALSE,
            .dataTimeoutInterruptEnable      = FALSE,
            .priority                        = 0,
            .provider                        = IfxSrc_Tos_cpu0
        },
        .pins       = NULL_PTR,
        .cardConfig = {
            .dataWidth = IfxSdmmc_EmmcDataTransferWidth_1Bit,
            .speedMode = IfxSdmmc_EmmcSpeedMode_legacy
        },
        .useDma    = FALSE,
        .dmaConfig = {
            .dmaType                         = IfxSdmmc_DmaType_sdma
        }
    };

    /* Default Configuration */
    *config = defaultConfig;

    /* take over module pointer */
    config->sdmmcSFR = sdmmcSFR;
}


IfxSdmmc_Status IfxSdmmc_Emmc_readBlock(IfxSdmmc_Emmc *emmc, uint32 address, uint32 *data)
{
    IfxSdmmc_Status status  = IfxSdmmc_Status_success;
    uint32          timeout = 0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* If the card is not initialized */
    if ((emmc->cardState & (uint8)IfxSdmmc_CardState_notInitialised) != 0U)
    {
        status = IfxSdmmc_Status_cardNotInitialised;
    }
    else
    {

        /* If byte Addressing, then multiply by 512 bytes */
        if ((uint32)emmc->cardCapacity == (uint32)IfxSdmmc_EmmcCardCapacity_byteAddressing)
        {
            address = (uint32)(address * IFXSDMMC_BLOCK_SIZE_DEFAULT);
        }

        if (emmc->dmaUsed == TRUE)
        {
            if (emmc->dmaType == IfxSdmmc_DmaType_adma2)
            {
                status = IfxSdmmc_Emmc_singleBlockAdma2Transfer(emmc, IfxSdmmc_Command_readSingleBlock, address, IFXSDMMC_BLOCK_SIZE_DEFAULT, data, IfxSdmmc_TransferDirection_read);
            }
            else
            {
                status = IfxSdmmc_Emmc_singleBlockDmaTransfer(emmc, IfxSdmmc_Command_readSingleBlock, address, IFXSDMMC_BLOCK_SIZE_DEFAULT, data, IfxSdmmc_TransferDirection_read);
            }
        }
        else
        {
            /* Single block transfer function */
            status = IfxSdmmc_Emmc_singleBlockTransfer(emmc, IfxSdmmc_Command_readSingleBlock, address, IFXSDMMC_BLOCK_SIZE_DEFAULT, data, IfxSdmmc_TransferDirection_read);
        }
    }

    /* Wait for until the command OR data lines aren't busy */
    /* check if command and data lines are free */
    timeout = IFXSDMMC_TIMEOUT_1E6;

    while ((emmcPtr->PSTATE_REG.B.CMD_INHIBIT_DAT || emmcPtr->PSTATE_REG.B.CMD_INHIBIT) && (timeout > 0))
    {
        timeout--;
    }

    if (timeout == 0)
    {
        status = IfxSdmmc_Status_timeout;
    }

