Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Sdmmc/Emmc/IfxSdmmc_Emmc.c
    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_readCid(IfxSdmmc_Emmc *emmc)
{
    IfxSdmmc_Status   status = IfxSdmmc_Status_success;
    IfxSdmmc_Response response;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    status                = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_allSendCID, IFXSDMMC_ARG_NONE, IfxSdmmc_ResponseType_r2, &response);
    emmc->cardInfo.cid[0] = response.resp01;
    emmc->cardInfo.cid[1] = response.resp23;
    emmc->cardInfo.cid[2] = response.resp45;
    emmc->cardInfo.cid[3] = response.resp67;

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_readCsd(IfxSdmmc_Emmc *emmc)
{
    IfxSdmmc_Status   status   = IfxSdmmc_Status_success;
    IfxSdmmc_Response response;
    uint32            argument = 0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    argument              = (uint32)(emmc->cardInfo.rca << IFXSDMMC_BITSHIFT_POS16);
    status                = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_sendCSD, argument, IfxSdmmc_ResponseType_r2, &response);
    emmc->cardInfo.csd[0] = response.resp01;
    emmc->cardInfo.csd[1] = response.resp23;
    emmc->cardInfo.csd[2] = response.resp45;
    emmc->cardInfo.csd[3] = response.resp67;
    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_setRca(IfxSdmmc_Emmc *emmc, uint16 rca)
{
    IfxSdmmc_Status   status   = IfxSdmmc_Status_success;
    IfxSdmmc_Response response;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    uint32            argument = (IFXSDMMC_ARG_NONE | (uint32)(rca << IFXSDMMC_BITSHIFT_POS16));
    status = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_mmcSetRelativeAddress, argument, IfxSdmmc_ResponseType_r1, &response);

    if (status == IfxSdmmc_Status_success)
    {
        emmc->cardInfo.rca = rca;
    }
    else
    {
        emmc->cardInfo.rca = IFXSDMMC_RCA_NONE;
    }

    return status;
}


void IfxSdmmc_Emmc_setupPins(IfxSdmmc_Emmc *emmc, IfxSdmmc_Emmc_Pins *pins)
{
    IFX_UNUSED_PARAMETER(emmc)
    IfxPort_InputMode inMode = pins->inputMode;
    IfxPort_PadDriver    speedGrade = pins->pinDriver;

    IfxSdmmc_Clk_Out    *clk        = pins->clk;
    IfxSdmmc_Cmd_InOut  *cmd        = pins->cmd;
    IfxSdmmc_Dat0_InOut *dat0       = pins->dat0;
    IfxSdmmc_Dat1_InOut *dat1       = pins->dat1;
    IfxSdmmc_Dat2_InOut *dat2       = pins->dat2;
    IfxSdmmc_Dat3_InOut *dat3       = pins->dat3;
    IfxSdmmc_Dat4_InOut *dat4       = pins->dat4;
    IfxSdmmc_Dat5_InOut *dat5       = pins->dat5;
    IfxSdmmc_Dat6_InOut *dat6       = pins->dat6;
    IfxSdmmc_Dat7_InOut *dat7       = pins->dat7;

    if (clk != NULL_PTR)
    {
        IfxPort_setPinModeOutput(clk->pin.port, clk->pin.pinIndex, IfxPort_OutputMode_pushPull, clk->outSelect);
        IfxPort_setPinPadDriver(clk->pin.port, clk->pin.pinIndex, speedGrade);
    }

    if (cmd != NULL_PTR)
    {
        IfxPort_setPinModeInput(cmd->pin.port, cmd->pin.pinIndex, inMode);
        IfxPort_setPinPadDriver(cmd->pin.port, cmd->pin.pinIndex, speedGrade);
    }

    if (dat0 != NULL_PTR)
    {
        IfxPort_setPinModeInput(dat0->pin.port, dat0->pin.pinIndex, inMode);
        IfxPort_setPinPadDriver(dat0->pin.port, dat0->pin.pinIndex, speedGrade);
    }

    if (dat1 != NULL_PTR)
    {
        IfxPort_setPinModeInput(dat1->pin.port, dat1->pin.pinIndex, inMode);
        IfxPort_setPinPadDriver(dat1->pin.port, dat1->pin.pinIndex, speedGrade);
    }

    if (dat2 != NULL_PTR)
    {
        IfxPort_setPinModeInput(dat2->pin.port, dat2->pin.pinIndex, inMode);
        IfxPort_setPinPadDriver(dat2->pin.port, dat2->pin.pinIndex, speedGrade);
    }

    if (dat3 != NULL_PTR)
    {
        IfxPort_setPinModeInput(dat3->pin.port, dat3->pin.pinIndex, inMode);
        IfxPort_setPinPadDriver(dat3->pin.port, dat3->pin.pinIndex, speedGrade);
    }

    if (dat4 != NULL_PTR)
    {
        IfxPort_setPinModeInput(dat4->pin.port, dat4->pin.pinIndex, inMode);
        IfxPort_setPinPadDriver(dat4->pin.port, dat4->pin.pinIndex, speedGrade);
    }

    if (dat5 != NULL_PTR)
    {
        IfxPort_setPinModeInput(dat5->pin.port, dat5->pin.pinIndex, inMode);
        IfxPort_setPinPadDriver(dat5->pin.port, dat5->pin.pinIndex, speedGrade);
    }

    if (dat6 != NULL_PTR)
    {
        IfxPort_setPinModeInput(dat6->pin.port, dat6->pin.pinIndex, inMode);
        IfxPort_setPinPadDriver(dat6->pin.port, dat6->pin.pinIndex, speedGrade);
    }

    if (dat7 != NULL_PTR)
    {
        IfxPort_setPinModeInput(dat7->pin.port, dat7->pin.pinIndex, inMode);
        IfxPort_setPinPadDriver(dat7->pin.port, dat7->pin.pinIndex, speedGrade);
    }
}


IfxSdmmc_Status IfxSdmmc_Emmc_singleBlockAdma2Transfer(IfxSdmmc_Emmc *emmc, IfxSdmmc_Command command, uint32 address, uint16 blockSize, uint32 *descrAddress, IfxSdmmc_TransferDirection direction)
{
    IfxSdmmc_Status   status  = IfxSdmmc_Status_success;
    IfxSdmmc_Response response;
    uint32            timeout = 0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* set the system address */
    IfxSdmmc_setSystemAddressForDma(emmcPtr, (uint32)descrAddress);

    emmcPtr->BLOCKSIZE.B.XFER_BLOCK_SIZE = blockSize;
	
    emmcPtr->XFER_MODE.B.MULTI_BLK_SEL = FALSE;

    /* Disable block count in transfer mode */
    emmcPtr->XFER_MODE.B.BLOCK_COUNT_ENABLE = 0;

    /* Enable DMA transfers */
    emmcPtr->XFER_MODE.B.DMA_ENABLE = 1;

    /* set transfer direction in host controller */
    emmcPtr->XFER_MODE.B.DATA_XFER_DIR = direction;

    status = IfxSdmmc_sendCommand(emmcPtr, command, address, IfxSdmmc_ResponseType_r1, &response);

    if (status == IfxSdmmc_Status_success)
    {
        timeout = IFXSDMMC_TIMEOUT_1E5; 

        /* wait until transfer complete or ADMA error flags are set */
        while ((IfxSdmmc_isNormalInterruptOccured(emmcPtr, IfxSdmmc_NormalInterrupt_transferComplete) == 0)
               && (IfxSdmmc_isErrorInterruptOccured(emmcPtr, IfxSdmmc_ErrorInterrupt_adma) == 0)
               && (timeout > 0))
        {
            timeout--;
        }

        if ((timeout == 0) || (IfxSdmmc_isErrorInterruptOccured(emmcPtr, IfxSdmmc_ErrorInterrupt_adma) != 0))
        {
            status = IfxSdmmc_Status_dataError;

            if (IfxSdmmc_isErrorInterruptOccured(emmcPtr, IfxSdmmc_ErrorInterrupt_adma) != 0)
            {
                IfxSdmmc_clearErrorInterrupt(emmcPtr, IfxSdmmc_ErrorInterrupt_adma);
            }

