Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Sdmmc/Emmc/IfxSdmmc_Emmc.c
        }
        else
        {
            IfxSdmmc_clearNormalInterrupt(emmcPtr, IfxSdmmc_NormalInterrupt_transferComplete);
        }
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_singleBlockDmaTransfer(IfxSdmmc_Emmc *emmc, IfxSdmmc_Command command, uint32 address, uint16 blockSize, uint32 *data, IfxSdmmc_TransferDirection direction)
{
    IfxSdmmc_Status   status  = IfxSdmmc_Status_success;
    IfxSdmmc_Response response;
    uint32            timeout = 0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* set the system address */
    IfxSdmmc_setSystemAddressForDma(emmcPtr, (uint32)data);

    emmcPtr->BLOCKSIZE.B.XFER_BLOCK_SIZE = blockSize;
	
    emmcPtr->XFER_MODE.B.MULTI_BLK_SEL = FALSE;

    /* Disable block count in transfer mode */
    IfxSdmmc_disableBlockCount(emmcPtr);
    emmcPtr->XFER_MODE.B.BLOCK_COUNT_ENABLE = 0;

    /* Enable DMA transfers */
    emmcPtr->XFER_MODE.B.DMA_ENABLE = 1;

    /* set transfer direction in host controller */
    emmcPtr->XFER_MODE.B.DATA_XFER_DIR = direction;

    status = IfxSdmmc_sendCommand(emmcPtr, command, address, IfxSdmmc_ResponseType_r1, &response);

    if (status == IfxSdmmc_Status_success)
    {
        timeout = IFXSDMMC_TIMEOUT_1E6; 

        /* wait until transfer complete flag is set */
        while ((IfxSdmmc_isNormalInterruptOccured(emmcPtr, IfxSdmmc_NormalInterrupt_transferComplete) == 0) && (timeout > 0))
        {
            timeout--;
        }

        if (timeout == 0)
        {
            status = IfxSdmmc_Status_dataError;
            /* FIME: implement abort command process */
        }
        else
        {
            IfxSdmmc_clearNormalInterrupt(emmcPtr, IfxSdmmc_NormalInterrupt_transferComplete);
        }
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_singleBlockTransfer(IfxSdmmc_Emmc *emmc, IfxSdmmc_Command command, uint32 address, uint16 blockSize, uint32 *data, IfxSdmmc_TransferDirection direction)
{
    IfxSdmmc_Status       status       = IfxSdmmc_Status_success;
    IfxSdmmc_Response     response;
    IfxSdmmc_ResponseType responseType = IfxSdmmc_ResponseType_r1;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    uint32                loopIndex    = 0;
    uint32                timeout      = 0;
    uint32                numWords     = (uint32)((blockSize + 3) >> IFXSDMMC_BITSHIFT_POS2);

    emmcPtr->BLOCKSIZE.B.XFER_BLOCK_SIZE = blockSize;
	
    emmcPtr->XFER_MODE.B.MULTI_BLK_SEL = FALSE;

    /* Disable block count in transfer mode */
    emmcPtr->XFER_MODE.B.BLOCK_COUNT_ENABLE = 0;

    /* set transfer direction in host controller */
    emmcPtr->XFER_MODE.B.DATA_XFER_DIR = direction;

    status = IfxSdmmc_sendCommand(emmcPtr, command, address, responseType, &response);

    if (status == IfxSdmmc_Status_success)
    {
        if (direction == IfxSdmmc_TransferDirection_read)
        {
            timeout = IFXSDMMC_TIMEOUT_1E6; 

            /* wait until Read ready flag is set */
            while ((IfxSdmmc_isNormalInterruptOccured(emmcPtr, IfxSdmmc_NormalInterrupt_bufferReadReady) == 0) && (timeout > 0))
            {
                timeout--;
            }

            if (timeout == 0)
            {
                status = IfxSdmmc_Status_dataError;
            }
            else
            {
                IfxSdmmc_clearNormalInterrupt(emmcPtr, IfxSdmmc_NormalInterrupt_bufferReadReady);
            }
        }
    }

    if (status == IfxSdmmc_Status_success)
    {
        /* Perform data transfer */
        /* 4 bytes data transmission in each iteration */
        for (loopIndex = 0U; loopIndex < numWords; loopIndex++)
        {
            if (direction == IfxSdmmc_TransferDirection_read)
            {
                *data = (uint32)emmcPtr->BUF_DATA.U;
            }

            if (direction == IfxSdmmc_TransferDirection_write)
            {
                emmcPtr->BUF_DATA.U = *data;
            }

            data++;
        }

        timeout = IFXSDMMC_TIMEOUT_1E6; 

        /* wait until transfer complete flag is set */
        while ((IfxSdmmc_isNormalInterruptOccured(emmcPtr, IfxSdmmc_NormalInterrupt_transferComplete) == 0) && (timeout > 0))
        {
            timeout--;
        }

        if (timeout == 0)
        {
            status = IfxSdmmc_Status_dataError;
        }
        else
        {
            IfxSdmmc_clearNormalInterrupt(emmcPtr, IfxSdmmc_NormalInterrupt_transferComplete);
        }
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_switchBusWidth(IfxSdmmc_Emmc *emmc, IfxSdmmc_EmmcDataTransferWidth busWidth)
{
    IfxSdmmc_Status   status   = IfxSdmmc_Status_success;
    IfxSdmmc_Response response;
    uint32            argument = 0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    if (busWidth == IfxSdmmc_EmmcDataTransferWidth_4Bit)
    {
        argument = IFXSDMMC_ARG_MMC_BUSWIDTH_4;
    }

    else if (busWidth == IfxSdmmc_EmmcDataTransferWidth_8Bit)
    {
        argument = IFXSDMMC_ARG_MMC_BUSWIDTH_8;
    }

    /* set the bus width on the host controller */
    IfxSdmmc_setEmmcDataTransferWidth(emmcPtr, busWidth);

    /* Switch card to desired bus width (CMD6) */
    status = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_mmcSwitchFunction, argument, IfxSdmmc_ResponseType_r1b, &response);

    /* if switch failed, change the bus width back to 1 bit */
    if (status != IfxSdmmc_Status_success)
    {
        IfxSdmmc_setEmmcDataTransferWidth(emmcPtr, IfxSdmmc_EmmcDataTransferWidth_1Bit);
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_switchToHighSpeed(IfxSdmmc_Emmc *emmc)
{
    IfxSdmmc_Status   status = IfxSdmmc_Status_success;
    IfxSdmmc_Response response;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* Switch card to high speed (CMD6) */
    status = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_mmcSwitchFunction, IFXSDMMC_ARG_MMC_HIGHSPEED, IfxSdmmc_ResponseType_r1b, &response);

