Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Sdmmc/Emmc/IfxSdmmc_Emmc.c
    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_switchToTransferState(IfxSdmmc_Emmc *emmc)
{
    IfxSdmmc_Status   status   = IfxSdmmc_Status_success;
    IfxSdmmc_Response response;
    uint32            argument = 0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    argument |= (uint32)(emmc->cardInfo.rca << IFXSDMMC_BITSHIFT_POS16);

    /* read card status CMD13 */
    status = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_sendStatus, argument, IfxSdmmc_ResponseType_r1, &response);

    if (status == IfxSdmmc_Status_success)
    {
        /* if the card is not in transfer state already Switch to transfer state (CMD7)*/
        if (response.cardStatus.B.currentState != 4)
        {
            status = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_selectDeselectCard, argument, IfxSdmmc_ResponseType_r1b, &response);
        }
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_validateAccessMode(IfxSdmmc_Emmc *emmc)
{
    IfxSdmmc_Status   status  = IfxSdmmc_Status_success;
    IfxSdmmc_Response response;
    uint32            timeout = (uint32)0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    timeout = (uint32)IFXSDMMC_TIMEOUT_1E6; 

    /* validate access mode (MMC_CMD1) */
    do
    {
        status = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_mmcSendOpCond, IFXSDMMC_ARG_MMCCMD1, IfxSdmmc_ResponseType_r3, &response);
        timeout--;
    } while (((response.resp01 >> IFXSDMMC_BITSHIFT_POS31) & 0x1) != 1 && (timeout > (uint32)0));

    if (status == IfxSdmmc_Status_success)
    {
        /* Check if pattern matches in both the argument and response */
        if (response.resp01 == IFXSDMMC_CARDCAPACITY_BYTEADDRESSING_PATTERN)
        {
            emmc->cardCapacity = (uint8)IfxSdmmc_EmmcCardCapacity_byteAddressing;
        }
        else if (response.resp01 == IFXSDMMC_CARDCAPACITY_SECTORADDRESSING_PATTERN)
        {
            emmc->cardCapacity = (uint8)IfxSdmmc_EmmcCardCapacity_sectorAddressing;
        }
        else /*((response.resp01 != 0x80FF8080) && (response.resp01 != 0xC0FF8080)) */
        {
            status = IfxSdmmc_Status_badResponse; /* device i s not compliant */
            emmcPtr->PWR_CTRL.B.SD_BUS_PWR_VDD1 = 0; /* Set bus power off */
            /* Update card initialization status */
            emmc->cardState &= (uint8)~((uint8)IfxSdmmc_CardState_notInitialised | (uint8)IfxSdmmc_CardState_noCard);
        }
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_writeBlock(IfxSdmmc_Emmc *emmc, uint32 address, uint32 *data)
{
    IfxSdmmc_Status status  = IfxSdmmc_Status_success;
    uint32          timeout = 0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* If the card is not initialized */
    if ((emmc->cardState & (uint8)IfxSdmmc_CardState_notInitialised) != 0U)
    {
        status = IfxSdmmc_Status_cardNotInitialised;
    }
    else
    {

        /* If byte addressing, then multiply by 512 bytes */
        if ((uint32)emmc->cardCapacity == (uint32)IfxSdmmc_EmmcCardCapacity_byteAddressing)
        {
            address = (uint32)(address * IFXSDMMC_BLOCK_SIZE_DEFAULT);
        }

        if (emmc->dmaUsed == TRUE)
        {
            if (emmc->dmaType == IfxSdmmc_DmaType_adma2)
            {
                status = IfxSdmmc_Emmc_singleBlockAdma2Transfer(emmc, IfxSdmmc_Command_writeBlock, address, IFXSDMMC_BLOCK_SIZE_DEFAULT, data, IfxSdmmc_TransferDirection_write);
            }
            else
            {
                status = IfxSdmmc_Emmc_singleBlockDmaTransfer(emmc, IfxSdmmc_Command_writeBlock, address, IFXSDMMC_BLOCK_SIZE_DEFAULT, data, IfxSdmmc_TransferDirection_write);
            }
        }
        else
        {
            /* Single block transfer function */
            status = IfxSdmmc_Emmc_singleBlockTransfer(emmc, IfxSdmmc_Command_writeBlock, address, IFXSDMMC_BLOCK_SIZE_DEFAULT, data, IfxSdmmc_TransferDirection_write);
        }

        if ((status == IfxSdmmc_Status_success) || (status == IfxSdmmc_Status_bufferReady))
        {
            status = IfxSdmmc_Status_success;
        }
        else
        {
            status = IfxSdmmc_Status_failure;
        }
    }

    /* Wait for until the command OR data lines aren't busy */
    /* check if command and data lines are free */
    timeout = IFXSDMMC_TIMEOUT_1E6; 

    while ((emmcPtr->PSTATE_REG.B.CMD_INHIBIT_DAT || emmcPtr->PSTATE_REG.B.CMD_INHIBIT) && (timeout > 0))
    {
        timeout--;
    }

    if (timeout == 0)
    {
        status = IfxSdmmc_Status_timeout;
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_eraseBlocks(IfxSdmmc_Emmc *emmc, uint32 startAddress, uint32 endAddress)
{
    IfxSdmmc_Status   status   = IfxSdmmc_Status_success;
    uint32            argument = (uint32)0;
    IfxSdmmc_Response response;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* If the card is not initialized */
    if ((emmc->cardState & (uint8)IfxSdmmc_CardState_notInitialised) != 0U)
    {
        status = IfxSdmmc_Status_cardNotInitialised;
    }
    else
    {

        /* If byte addressing, then multiply by 512 bytes */
        if ((uint32)emmc->cardCapacity == (uint32)IfxSdmmc_EmmcCardCapacity_byteAddressing)
        {
            startAddress = (uint32)(startAddress * IFXSDMMC_BLOCK_SIZE_DEFAULT);
            endAddress   = (uint32)(endAddress * IFXSDMMC_BLOCK_SIZE_DEFAULT);
        }

        /* Set the Start Address */
        argument = startAddress;
        status   = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_mmcEraseGroupStart, argument, IfxSdmmc_ResponseType_r1, &response);

        if (status == IfxSdmmc_Status_success)
        {
            /* set the end Address */
            argument = endAddress;
            status   = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_mmcEraseGroupEnd, argument, IfxSdmmc_ResponseType_r1, &response);

            if (status == IfxSdmmc_Status_success)
            {
                /* send the TRIM command to erase */
                argument = IFXSDMMC_ARG_CMD38_TRIM;
                status   = IfxSdmmc_sendCommand(emmcPtr, IfxSdmmc_Command_erase, argument, IfxSdmmc_ResponseType_r1b, &response);
            }
        }
    }

