Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Sdmmc/Emmc/IfxSdmmc_Emmc.c
    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_readMultiBlock(IfxSdmmc_Emmc *emmc, uint32 address, uint32 *data, uint32 numBlocks)
{
    IfxSdmmc_Status status  = IfxSdmmc_Status_success;
    uint32          timeout = 0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* If the card is not initialized */
    if ((emmc->cardState & (uint8)IfxSdmmc_CardState_notInitialised) != 0U)
    {
        status = IfxSdmmc_Status_cardNotInitialised;
    }
    else
    {
        /* If byte Addressing, then multiply by 512 bytes */
        if ((uint32)emmc->cardCapacity == (uint32)IfxSdmmc_EmmcCardCapacity_byteAddressing)
        {
            address = (uint32)(address * IFXSDMMC_BLOCK_SIZE_DEFAULT);
        }

        if (emmc->dmaUsed == TRUE)
        {
            if (emmc->dmaType == IfxSdmmc_DmaType_adma2)
            {
                status = IfxSdmmc_Emmc_multiBlockAdma2Transfer(emmc, IfxSdmmc_Command_readMultipleBLock, address, IFXSDMMC_BLOCK_SIZE_DEFAULT, (uint16)numBlocks, data, IfxSdmmc_TransferDirection_read);
            }
            else
            {
                status = IfxSdmmc_Status_failure;  /* only ADMA2 support currently */
            }
        }
        else
        {
            /* Single block transfer function */
            status = IfxSdmmc_Emmc_multiBlockTransfer(emmc, IfxSdmmc_Command_readMultipleBLock, address, IFXSDMMC_BLOCK_SIZE_DEFAULT, (uint16)numBlocks, data, IfxSdmmc_TransferDirection_read);
        }
    }

    /* Wait for until the command OR data lines aren't busy */
    /* check if command and data lines are free */
    timeout = IFXSDMMC_TIMEOUT_1E6; 

    while ((emmcPtr->PSTATE_REG.B.CMD_INHIBIT_DAT || emmcPtr->PSTATE_REG.B.CMD_INHIBIT) && (timeout > 0))
    {
        timeout--;
    }

    if (timeout == 0)
    {
        status = IfxSdmmc_Status_timeout;
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_writeMultiBlock(IfxSdmmc_Emmc *emmc, uint32 address, uint32 *data, uint32 numBlocks)
{
    IfxSdmmc_Status status  = IfxSdmmc_Status_success;
    uint32          timeout = 0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* If the card is not initialized */
    if ((emmc->cardState & (uint8)IfxSdmmc_CardState_notInitialised) != 0U)
    {
        status = IfxSdmmc_Status_cardNotInitialised;
    }
    else
    {
        /* If byte addressing, then multiply by 512 bytes */
        if ((uint32)emmc->cardCapacity == (uint32)IfxSdmmc_EmmcCardCapacity_byteAddressing)
        {
            address = (uint32)(address * IFXSDMMC_BLOCK_SIZE_DEFAULT);
        }

        if (emmc->dmaUsed == TRUE)
        {
            if (emmc->dmaType == IfxSdmmc_DmaType_adma2)
            {
                status = IfxSdmmc_Emmc_multiBlockAdma2Transfer(emmc, IfxSdmmc_Command_writeMultipleBlock, address, IFXSDMMC_BLOCK_SIZE_DEFAULT, (uint16)numBlocks, data, IfxSdmmc_TransferDirection_write);
            }
            else
            {
                status = IfxSdmmc_Status_failure;  /* only ADMA2 support currently */
            }
        }
        else
        {
            /* Single block transfer function */
            status = IfxSdmmc_Emmc_multiBlockTransfer(emmc, IfxSdmmc_Command_writeMultipleBlock, address, IFXSDMMC_BLOCK_SIZE_DEFAULT, (uint16)numBlocks, data, IfxSdmmc_TransferDirection_write);
        }

        if ((status == IfxSdmmc_Status_success) || (status == IfxSdmmc_Status_bufferReady))
        {
            status = IfxSdmmc_Status_success;
        }
        else
        {
            status = IfxSdmmc_Status_failure;
        }
    }

    /* Wait for until the command OR data lines aren't busy */
    /* check if command and data lines are free */
    timeout = IFXSDMMC_TIMEOUT_1E6; 

    while ((emmcPtr->PSTATE_REG.B.CMD_INHIBIT_DAT || emmcPtr->PSTATE_REG.B.CMD_INHIBIT) && (timeout > 0))
    {
        timeout--;
    }

    if (timeout == 0)
    {
        status = IfxSdmmc_Status_timeout;
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_multiBlockTransfer(IfxSdmmc_Emmc *emmc, IfxSdmmc_Command command, uint32 address, uint16 blockSize, uint16 numBlocks, uint32 *data, IfxSdmmc_TransferDirection direction)
{
    IfxSdmmc_Status       status       = IfxSdmmc_Status_success;
    IfxSdmmc_Response     response;
    IfxSdmmc_ResponseType responseType = IfxSdmmc_ResponseType_r1;

    uint32                loopIndex    = 0;
    uint32                timeout      = 0;
    uint32                numWords     = (uint32)((blockSize + 3) >> IFXSDMMC_BITSHIFT_POS2);
    uint32                blockIndex   = 0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    emmcPtr->BLOCKSIZE.B.XFER_BLOCK_SIZE = blockSize;

    if (numBlocks > 1)
    {
        IfxSdmmc_setBlockCount(emmcPtr, numBlocks);
        emmcPtr->XFER_MODE.B.MULTI_BLK_SEL = TRUE; /* Set multi-block select */
        emmcPtr->XFER_MODE.B.BLOCK_COUNT_ENABLE = 1; /* Enable block count */
    }
    else
    {
        IFX_ASSERT(IFX_VERBOSE_LEVEL_ERROR, FALSE); /* use Single block API!! */
    }

    /* set transfer direction in host controller */
    emmcPtr->XFER_MODE.B.DATA_XFER_DIR = direction;

    emmcPtr->XFER_MODE.B.AUTO_CMD_ENABLE = IfxSdmmc_AutoCmdSelect_cmd23; /* Set auto command enable */

    status = IfxSdmmc_sendCommand(emmcPtr, command, address, responseType, &response);

    if (status == IfxSdmmc_Status_success)
    {
        switch (direction)
        {
        case IfxSdmmc_TransferDirection_read:
        {
            /* read each block as buffer gets ready */
            for (blockIndex = 0; blockIndex < numBlocks; blockIndex++)
            {
                timeout = IFXSDMMC_TIMEOUT_1E6;

                /* wait until Read ready flag is set */
                while ((IfxSdmmc_isNormalInterruptOccured(emmcPtr, IfxSdmmc_NormalInterrupt_bufferReadReady) == 0) && (timeout > 0))
                {
                    timeout--;
                }

                if (timeout == 0)
                {
                    status = IfxSdmmc_Status_dataError;
                    break;
                }
                else
                {
                    /* Read buffer is ready. Clear the interrupt first */
                    IfxSdmmc_clearNormalInterrupt(emmcPtr, IfxSdmmc_NormalInterrupt_bufferReadReady);

                    /* Now read one block from buffer */
                    for (loopIndex = 0U; loopIndex < numWords; loopIndex++)
                    {
                        *data = (uint32)IfxSdmmc_readBufferData(emmcPtr);
                        data++;
                    }
                }
            }

            break;
        }
        case IfxSdmmc_TransferDirection_write:
        {
            {
                /* write each block as buffer gets ready */
                for (blockIndex = 0; blockIndex < numBlocks; blockIndex++)
                {
                    timeout = IFXSDMMC_TIMEOUT_1E6; 

                    /* wait until Read ready flag is set */
                    while ((IfxSdmmc_isNormalInterruptOccured(emmcPtr, IfxSdmmc_NormalInterrupt_bufferWriteReady) == 0) && (timeout > 0))
                    {
                        timeout--;
                    }

                    if (timeout == 0)
                    {
                        status = IfxSdmmc_Status_dataError;
                        break;
                    }
                    else
                    {
                        /* Write buffer is ready. Clear the interrupt first */
                        IfxSdmmc_clearNormalInterrupt(emmcPtr, IfxSdmmc_NormalInterrupt_bufferWriteReady);

                        /* Now read one block from buffer */
                        for (loopIndex = 0U; loopIndex < numWords; loopIndex++)
                        {
                            IfxSdmmc_writeBufferData(emmcPtr, data);
                            data++;
                        }
                    }
                }

                break;
            }
        }
        default:
        {
            break;
        }
        }
    }

    if (status == IfxSdmmc_Status_success)
    {
        timeout = IFXSDMMC_TIMEOUT_1E6;

