Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Sdmmc/Emmc/IfxSdmmc_Emmc.c
        /* wait until transfer complete flag is set */
        while ((IfxSdmmc_isNormalInterruptOccured(emmcPtr, IfxSdmmc_NormalInterrupt_transferComplete) == 0) && (timeout > 0))
        {
            timeout--;
        }

        if (timeout == 0)
        {
            status = IfxSdmmc_Status_dataError;
            /* FIME: implement abort command process */
        }
        else
        {
            IfxSdmmc_clearNormalInterrupt(emmcPtr, IfxSdmmc_NormalInterrupt_transferComplete);
        }
    }

    return status;
}


IfxSdmmc_Status IfxSdmmc_Emmc_multiBlockAdma2Transfer(IfxSdmmc_Emmc *emmc, IfxSdmmc_Command command, uint32 address, uint16 blockSize, uint16 numBlocks, uint32 *descrAddress, IfxSdmmc_TransferDirection direction)
{
    IfxSdmmc_Status   status  = IfxSdmmc_Status_success;
    IfxSdmmc_Response response;
    uint32            timeout = 0;
    
    /* Local pointer for emmc->sdmmcSFR*/
    Ifx_SDMMC *emmcPtr = emmc->sdmmcSFR; 

    /* set the system address */
    IfxSdmmc_setSystemAddressForDma(emmcPtr, (uint32)descrAddress);

    emmcPtr->BLOCKSIZE.B.XFER_BLOCK_SIZE = blockSize;

    if (numBlocks > 1)
    {
        IfxSdmmc_setBlockCount(emmcPtr, numBlocks);
        emmcPtr->XFER_MODE.B.MULTI_BLK_SEL = TRUE; /* Set multi-block select */
        emmcPtr->XFER_MODE.B.BLOCK_COUNT_ENABLE = 1; /* Enable block count */
    }
    else
    {
        IFX_ASSERT(IFX_VERBOSE_LEVEL_ERROR, FALSE); /* use Single block API!! */
    }

    emmcPtr->XFER_MODE.B.DMA_ENABLE = 1; /* Enable DMA transfers */

    /* set transfer direction in host controller */
    emmcPtr->XFER_MODE.B.DATA_XFER_DIR = direction;

    emmcPtr->XFER_MODE.B.AUTO_CMD_ENABLE = IfxSdmmc_AutoCmdSelect_cmd23; /* Set auto command enable */

    status = IfxSdmmc_sendCommand(emmcPtr, command, address, IfxSdmmc_ResponseType_r1, &response);

    if (status == IfxSdmmc_Status_success)
    {
        timeout = IFXSDMMC_TIMEOUT_1E5;

        /* wait until transfer complete or adma error flags are set */
        while ((IfxSdmmc_isNormalInterruptOccured(emmcPtr, IfxSdmmc_NormalInterrupt_transferComplete) == 0)
               && (IfxSdmmc_isErrorInterruptOccured(emmcPtr, IfxSdmmc_ErrorInterrupt_adma) == 0)
               && (timeout > 0))
        {
            timeout--;
        }

        if ((timeout == 0) || (IfxSdmmc_isErrorInterruptOccured(emmcPtr, IfxSdmmc_ErrorInterrupt_adma) != 0))
        {
            status = IfxSdmmc_Status_dataError;

            if (IfxSdmmc_isErrorInterruptOccured(emmcPtr, IfxSdmmc_ErrorInterrupt_adma) != 0)
            {
                IfxSdmmc_clearErrorInterrupt(emmcPtr, IfxSdmmc_ErrorInterrupt_adma);
            }

        }
        else
        {
            IfxSdmmc_clearNormalInterrupt(emmcPtr, IfxSdmmc_NormalInterrupt_transferComplete);
        }
    }

    return status;
}
#endif

#if defined (_TASKING_) || defined (_ghs_)
#pragma restore
#endif
